knei-knurow/lidar-visualizations/stm32-discovery/Core/Src/lidar.cpp
#include <string>
#include <iostream>
#include <fstream>
#include <algorithm>
#include <sstream>
#include <vector>
#include <cmath>
#include <utility>
//#include <SFML\System.hpp>
//#include <SFML\Window.hpp>
//#include <SFML\Graphics.hpp>
#include "main.h"
#include "cmsis_os.h"
#include "lidar.h"
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_lcd.h"
#include "characters.h"


color::color(uint8_t r, uint8_t g, uint8_t b, uint8_t alpha){
	this->r = r;
	this->g = g;
	this->b = b;
	this->a = alpha;




};


Color::Color(uint8_t r, uint8_t g, uint8_t b) {
	this->r = r;
	this->g = g;
	this->g = g;
}

//
// IO
//
void load_cloud(const std::string& filename, Cloud& cloud, int k, float scale) {
	std::ifstream file(filename);
	while (file) {
		std::string line;
		std::getline(file, line);
		if (line.empty() || line[0] == '#')
			continue;
		float angle, dist;
		std::stringstream sline(line);
		sline >> angle >> dist;

		if (dist > cloud.max) cloud.max = dist;
		else if (dist < cloud.min) cloud.min = dist;
		cloud.size++;
		cloud.avg += dist;
		cloud.pts.push_back(std::make_pair(angle, dist));
	}
	cloud.avg /= cloud.size;
	for (auto& pt : cloud.pts) {
		cloud.std += (cloud.avg - pt.second) * (cloud.avg - pt.second);
	}
	cloud.std = std::sqrt(cloud.std);
	find_shape(cloud, k, scale);
}


void draw_connected_cloud(uint8_t* mat, const Cloud& cloud, float scale, int y_offset, float lightness, bool marks) {
	if (scale == 0)
		scale = calc_scale(cloud);

	if (cloud.size == 0)
		return;

	int cnt = 1;
	auto first_pt = cyl_to_cart(cloud.pts[0], scale);
	auto last_pt = first_pt;
	std::vector<size_t> mark_pt_idx;
	if (cloud.pts[0].second == cloud.max || cloud.pts[0].second == cloud.min)
		mark_pt_idx.push_back(0);
	for (int i = 1; i < cloud.size; i++) {
		auto pt = cyl_to_cart(cloud.pts[i], scale);
		auto c = calc_color(float(cnt) / float(cloud.size), lightness);


		if ((cloud.pts[i].second == cloud.max || cloud.pts[i].second == cloud.min))
			mark_pt_idx.push_back(i);
		if (cloud.pts[i].second > 0 && cloud.pts[i - 1].second > 0)
			draw_line(mat, float(last_pt.first), float(last_pt.second + y_offset), float(pt.first), float(pt.second) + y_offset, c);

		/*
		if (cloud.pts[i].second == cloud.max || cloud.pts[i].second == cloud.min)
		mark_pt_idx.push_back(i);
		draw_line(mat, float(last_pt.first), float(last_pt.second + y_offset), float(pt.first), float(pt.second) + y_offset, c);

		*/
		last_pt = pt;
		cnt++;
	}
	auto c = calc_color(float(cnt) / float(cloud.size), lightness);
	draw_line(mat, float(last_pt.first), float(last_pt.second + y_offset), float(first_pt.first), float(first_pt.second + y_offset), c);

	if (marks) {
		for (auto i : mark_pt_idx) {
			auto pt = cyl_to_cart(cloud.pts[i], scale);
			draw_point(mat, pt.first, pt.second + y_offset, color(255, 255, 255));
			draw_mark(mat, pt.first, pt.second + y_offset, unsigned(cloud.pts[i].second / 1000), unsigned(cloud.pts[i].second) % 1000, color(255, 255, 255));
		}
	}
}


void remove_connected_cloud(uint8_t* mat, const Cloud& cloud, float scale, int y_offset, float lightness, bool marks) {
	if (scale == 0)
		scale = calc_scale(cloud);

	if (cloud.size == 0)
		return;

	int cnt = 1;
	auto first_pt = cyl_to_cart(cloud.pts[0], scale);
	auto last_pt = first_pt;
	std::vector<size_t> mark_pt_idx;
	if (cloud.pts[0].second == cloud.max || cloud.pts[0].second == cloud.min)
		mark_pt_idx.push_back(0);
	for (int i = 1; i < cloud.size; i++) {
		auto pt = cyl_to_cart(cloud.pts[i], scale);
		auto c = color(0,0,0);

		if (cloud.pts[i].second == cloud.max || cloud.pts[i].second == cloud.min)
			mark_pt_idx.push_back(i);
		draw_line(mat, float(last_pt.first), float(last_pt.second + y_offset), float(pt.first), float(pt.second) + y_offset, c);
		last_pt = pt;
		cnt++;
	}
	auto c = calc_color(float(cnt) / float(cloud.size), lightness);
	draw_line(mat, float(last_pt.first), float(last_pt.second + y_offset), float(first_pt.first), float(first_pt.second + y_offset), c);

	if (marks) {
		for (auto i : mark_pt_idx) {
			auto pt = cyl_to_cart(cloud.pts[i], scale);
			draw_point(mat, pt.first, pt.second + y_offset, color(255, 255, 255));
			draw_mark(mat, pt.first, pt.second + y_offset, unsigned(cloud.pts[i].second / 1000), unsigned(cloud.pts[i].second) % 1000, color(0, 0, 0));
		}
	}
}



void draw_mark(uint8_t* mat, unsigned x, unsigned y, unsigned a, unsigned b, color c) {
	draw_point(mat, x, y, c);
	auto str = std::to_string(a) + "." + std::to_string(b);
	x += -12;
	y += 5;
	for (int ch : str) {
		if (ch == '.') ch = CHAR_DOT;
		else ch -= '0';

		for (int cy = 0; cy < CHAR_HEIGHT; cy++) {
			for (int cx = 0; cx < CHAR_MAT[ch][cy].size(); cx++) {
				if (CHAR_MAT[ch][cy][cx] == '#')
					draw_pixel(mat, x + cx, y + cy, c);
			}
		}
		x += CHAR_MAT[ch][0].size() + 1;
	}
}

void load_cloud_fromString(std::string& string, Cloud& cloud, int k, float scale) {
	std::stringstream fakefile(string);
	while (fakefile) {
		std::string line;
		std::getline(fakefile, line);
		if (line.empty() || line[0] == '#')
			continue;
		float angle, dist;
		std::stringstream sline(line);
		sline >> angle >> dist;

		if (dist > cloud.max) cloud.max = dist;
		else if (dist < cloud.min) cloud.min = dist;
		cloud.size++;
		cloud.avg += dist;
		cloud.pts.push_back(std::make_pair(angle, dist));
	}
	cloud.avg /= cloud.size;
	for (auto& pt : cloud.pts) {
		cloud.std += (cloud.avg - pt.second) * (cloud.avg - pt.second);
	}
	cloud.std = std::sqrt(cloud.std);
	//find_shape(cloud, k, scale);
}



void cloud_addPair(Cloud& cloud, float angle, float distance, int k,  float scale) {

	if (distance > cloud.max) cloud.max = distance;
	else if (distance < cloud.min) cloud.min = distance;
	cloud.size++;
	cloud.avg += distance;
	cloud.pts.push_back(std::make_pair(angle, distance));

	cloud.avg /= cloud.size;
	for (auto& pt : cloud.pts)
	{
		cloud.std += (cloud.avg - pt.second) * (cloud.avg - pt.second);
	}

	cloud.std = std::sqrt(cloud.std);
	//find_shape(cloud, k, scale);
}



//
// Drawing
//

/*
void draw_pixel(uint8_t* mat, unsigned x, unsigned y, color c) {
	if (x < 0 || x > WIDTH - 1 || y < 0 || y > HEIGHT - 1)
		return;
	mat[(WIDTH * y + x) * CHANNELS + 0] = c.r;
	mat[(WIDTH * y + x) * CHANNELS + 1] = c.g;
	mat[(WIDTH * y + x) * CHANNELS + 2] = c.b;
	mat[(WIDTH * y + x) * CHANNELS + 3] = c.a;
}
*/

void draw_pixel(uint8_t* mat, unsigned x, unsigned y, color c)
{

	uint32_t color = (c.a << 24) + (c.r << 16) + (c.g << 8) + c.b;

	if(x <= WIDTH && y <= HEIGHT)
	{
		BSP_LCD_DrawPixel(x, y, color);
	}
}

void draw_point(uint8_t* mat, unsigned x, unsigned y, color c, float lightness) {
	c.r *= lightness;
	c.g *= lightness;
	c.b *= lightness;
	for (auto cx : { -1, 0, 1 }) {
		for (auto cy : { -1, 0, 1 }) {


