knei-knurow/lidar-visualizations/stm32-discovery/Core/Src/lidar.cpp
				draw_pixel(mat, x + cx, y + cy, c);

		}
	}
}

void draw_point(uint8_t* mat, unsigned x, unsigned y, float lightness) {
	color c = calc_color(x, y);
	draw_point(mat, x, y, c, lightness);
}

void draw_line(uint8_t* mat, float x0, float y0, float x1, float y1, color c) {
	float x = x1 - x0, y = y1 - y0;
	const float max = std::max(std::fabs(x), std::fabs(y));
	x /= max; y /= max;
	for (float n = 0; n < max; n++) {
		draw_point(mat, x0, y0, c);
		x0 += x; y0 += y;
	}
}

void draw_ray(uint8_t* mat, float x0, float y0, float x1, float y1, color c) {
	float x = x1 - x0, y = y1 - y0;
	const float max = std::max(std::fabs(x), std::fabs(y));
	x /= max; y /= max;
	while (x0 < WIDTH && x0 >= 0 && y0 < HEIGHT && y0 >= 0) {
		draw_point(mat, x0, y0, c);
		x0 += x; y0 += y;
	}
}

void draw_background(uint8_t* mat, color c) {
	uint32_t color = (c.a << 24) + (c.r << 16) + (c.g << 8) + c.b;
	for (int i = 0; i < WIDTH; i++) {
		for(int j = 0; j < HEIGHT; j++)
		{
			BSP_LCD_DrawPixel(i, j, color);
		}
	}
}

void draw_grid(uint8_t* mat, color c) {
	for (int x = 0; x < WIDTH; x += WIDTH / 8) {
		for (int y = 0; y < HEIGHT; y++) {
			draw_pixel(mat, x, y, c);
		}
	}
	for (int y = 0; y < HEIGHT; y += HEIGHT / 8) {
		for (int x = 0; x < WIDTH; x++) {
			draw_pixel(mat, x, y, c);
		}
	}
}

void draw_cloud_bars(uint8_t* mat, const Cloud& cloud) {
	unsigned max_width = 80;
	for (int j = 0; j < HEIGHT; j++) {
		float dist = cloud.pts[size_t(j * cloud.size / HEIGHT)].second;

		unsigned width = unsigned(std::round(dist / cloud.max * max_width));

		for (int i = 0; i < width; i++) {
			draw_pixel(mat, i, j, calc_color(float(j * cloud.size / HEIGHT) / float(cloud.size)));
		}
	}
}

void draw_cloud(uint8_t* mat, const Cloud& cloud, float k, color c) {
	for (auto& pt : cloud.pts) {
		float phi = pt.first;
		float dist = pt.second;
		int x = std::round(dist * std::sin(phi * (acos(-1) / 180.0)) * k) + ORIGIN_X;
		int y = std::round(dist * std::cos(phi * (acos(-1) / 180.0)) * k) + ORIGIN_Y;

		draw_point(mat, x, y);
	}
}

void draw_cloud_shape(uint8_t* mat, const Cloud& cloud, int y_offset, float lightness) {
	std::pair<int, int> pt_prev, pt = cloud.pts.back();
	float dist_prev, dist = cloud.pts.back().second;
	int cnt = 0;
	for (int i = 0; i < cloud.shape.size(); i++) {
		pt_prev = pt;
		dist_prev = dist;
		pt = cloud.shape[i].front();
		draw_point(mat, pt.first, pt.second + y_offset, calc_color(float(cnt) / float(cloud.size), lightness));
		cnt++;
		for (int j = 1; j < cloud.shape[i].size(); j++) {
			pt_prev = pt;
			pt = cloud.shape[i][j];
			draw_line(mat, pt_prev.first, pt_prev.second + y_offset, pt.first, pt.second + y_offset, calc_color(float(cnt) / float(cloud.size), lightness));
			cnt++;
		}
	}

}


void remove_cloud_shape(uint8_t* mat, const Cloud& cloud, int y_offset) {
	std::pair<int, int> pt_prev, pt = cloud.pts.back();
	float dist_prev, dist = cloud.pts.back().second;
	int cnt = 0;
	for (int i = 0; i < cloud.shape.size(); i++) {
		pt_prev = pt;
		dist_prev = dist;
		pt = cloud.shape[i].front();
		draw_point(mat, pt.first, pt.second + y_offset, COLOR_BACKGROUND, 1);
		cnt++;
		for (int j = 1; j < cloud.shape[i].size(); j++) {
			pt_prev = pt;
			pt = cloud.shape[i][j];
			draw_line(mat, pt_prev.first, pt_prev.second + y_offset, pt.first, pt.second + y_offset, COLOR_BACKGROUND);
			cnt++;
		}
	}

}


color calc_color(float v, float lightness) {
	if (v >= 0 && v <= 0.33f) {
		color c0 = COLOR_CLOUD0;
		color c1 = COLOR_CLOUD1;
		c0.r *= v / 0.34f;
		c0.g *= v / 0.34f;
		c0.b *= v / 0.34f;
		c1.r *= 1.0 - v / 0.34f;
		c1.g *= 1.0 - v / 0.34f;
		c1.b *= 1.0 - v / 0.34f;
		return color((c0.r + c1.r) * lightness, (c0.g + c1.g) * lightness, (c0.b + c1.b) * lightness);
	}
	else if (v <= 0.66f) {
		v -= 0.33;
		color c0 = COLOR_CLOUD2;
		color c1 = COLOR_CLOUD0;
		c0.r *= v / 0.34f;
		c0.g *= v / 0.34f;
		c0.b *= v / 0.34f;
		c1.r *= 1.0 - v / 0.34f;
		c1.g *= 1.0 - v / 0.34f;
		c1.b *= 1.0 - v / 0.34f;
		return color((c0.r + c1.r) * lightness, (c0.g + c1.g) * lightness, (c0.b + c1.b) * lightness);
	}
	else if (v <= 1.0f) {
		v -= 0.66;
		color c0 = COLOR_CLOUD1;
		color c1 = COLOR_CLOUD2;
		c0.r *= v / 0.34f;
		c0.g *= v / 0.34f;
		c0.b *= v / 0.34f;
		c1.r *= 1.0 - v / 0.34f;
		c1.g *= 1.0 - v / 0.34f;
		c1.b *= 1.0 - v / 0.34f;
		return color((c0.r + c1.r) * lightness, (c0.g + c1.g) * lightness, (c0.b + c1.b) * lightness);
	}
	else {
		return color(255 * lightness, 255 * lightness, 255 * lightness);
	}
}

//
// Point cloud calculations
//
std::pair<int, int> cyl_to_cart(std::pair<float, float> pt, float k) {
	float phi = pt.first;
	float dist = pt.second;
	int x = std::round(dist * std::sin(phi * (acos(-1) / 180.0)) * k) + ORIGIN_X;
	int y = std::round(dist * std::cos(phi * (acos(-1) / 180.0)) * k) + ORIGIN_Y;
	return std::make_pair(x, y);
}

float calc_scale(const Cloud& cloud) {
	return float(HEIGHT) * 0.7 / cloud.max;
}

void find_shape(Cloud& cloud, float q, float scale) {
	if (scale == 0)
		scale = calc_scale(cloud);
	cloud.shape = { {cyl_to_cart(cloud.pts[0], scale)} };
	for (size_t i = 1; i < cloud.size; i++) {
		float dist0 = cloud.pts[i - 1].second;
		float dist1 = cloud.pts[i].second;

		if (std::fabs(dist0 - dist1) <= q) {
			cloud.shape.back().push_back(cyl_to_cart(cloud.pts[i], scale));
		}
		else {
			cloud.shape.push_back({ cyl_to_cart(cloud.pts[i], scale) });
		}
	}
}

void rotate_cloud(Cloud& cloud, float angle) {
	for (auto& i : cloud.pts) {
		i.first += angle;
		if (i.first >= 360) i.first -= 360;
	}
}

float perpendicular_dst(const std::pair<float, float>& pt, const std::pair<float, float>& line_start, const std::pair<float, float>& line_end) {
	float dx = line_end.first - line_start.first;
	float dy = line_end.second - line_start.second;

	float mag = std::pow(std::pow(dx, 2.0) + std::pow(dy, 2.0), 0.5);
	if (mag > 0.0) {
		dx /= mag; dy /= mag;
	}

	float pvx = pt.first - line_start.first;
	float pvy = pt.second - line_start.second;

	float pvdot = dx * pvx + dy * pvy;

	float dsx = pvdot * dx;
	float dsy = pvdot * dy;

	float ax = pvx - dsx;
	float ay = pvy - dsy;

